4dpanda_ci/app/Models/SettingsModel.php

    public function getSiteMeta($url){
        if(!$url){
            $rows = $this->like('option_name', 'default_site_', 'after')->findAll();
            $str = 'default_site_';
        }
        else {
            $rows = $this->like('option_name', "$url".'_', 'after')->where('option_type','dynamic_option')->findAll();
            $meta_script = $this->where('option_name','default_site_script')->first();

            //var_dump($meta_script);exit();
            if(empty($rows)){
                $rows =  $this->like('option_name', 'default_site_', 'after')->findAll();
---
SELECT *
FROM `settings`
WHERE `option_name` LIKE 'history-9692_%' ESCAPE '!'
AND `option_type` = 'dynamic_option'
SELECT *
FROM `settings`
WHERE `option_name` = 'default_site_script'
 LIMIT 1
SELECT *
FROM `settings`
WHERE `option_name` LIKE 'default_site_%' ESCAPE '!'

    public function getSEOContent($url){
        if(!$url){
            $row = $this->where('option_name', 'home_seo_content')->first();
        }
        else {
            $row = $this->where('option_name', "$url".'_seo_content')->first();
---
SELECT *
FROM `settings`
WHERE `option_name` = 'history-9692_seo_content'
 LIMIT 1

    public function getH1Title($uri){
        $row = $this->where(['option_type' =>'heading_option'])->like('option_name', $uri."_h1_title")->first();
---
SELECT *
FROM `settings`
WHERE `option_type` = 'heading_option'
AND  `option_name` LIKE '%history-9692_h1_title%' ESCAPE '!'
 LIMIT 1